# Múltiples índices (14/29)

In [1]:
import pandas as pd 
import numpy as np

In [11]:
df_pob = pd.read_csv('./pandas/poblacion.csv', skiprows=4) # Skiprows nos ayuda a ignorar la cantidad de filas que queramos en este caso son 4
df_pob

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,Unnamed: 65
0,Aruba,ABW,"Population, total",SP.POP.TOTL,54211.0,55438.0,56225.0,56695.0,57032.0,57360.0,...,102560.0,103159.0,103774.0,104341.0,104872.0,105366.0,105845.0,106314.0,NaN,NaN
1,Afghanistan,AFG,"Population, total",SP.POP.TOTL,8996973.0,9169410.0,9351441.0,9543205.0,9744781.0,9956320.0,...,31161376.0,32269589.0,33370794.0,34413603.0,35383128.0,36296400.0,37172386.0,38041754.0,NaN,NaN
2,Angola,AGO,"Population, total",SP.POP.TOTL,5454933.0,5531472.0,5608539.0,5679458.0,5735044.0,5770570.0,...,25107931.0,26015780.0,26941779.0,27884381.0,28842484.0,29816748.0,30809762.0,31825295.0,NaN,NaN
3,Albania,ALB,"Population, total",SP.POP.TOTL,1608800.0,1659800.0,1711319.0,1762621.0,1814135.0,1864791.0,...,2900401.0,2895092.0,2889104.0,2880703.0,2876101.0,2873457.0,2866376.0,2854191.0,NaN,NaN
4,Andorra,AND,"Population, total",SP.POP.TOTL,13411.0,14375.0,15370.0,16412.0,17469.0,18549.0,...,82427.0,80774.0,79213.0,78011.0,77297.0,77001.0,77006.0,77142.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
259,Kosovo,XKX,"Population, total",SP.POP.TOTL,947000.0,966000.0,994000.0,1022000.0,1050000.0,1078000.0,...,1807106.0,1818117.0,1812771.0,1788196.0,1777557.0,1791003.0,1797085.0,1794248.0,NaN,NaN
260,"Yemen, Rep.",YEM,"Population, total",SP.POP.TOTL,5315355.0,5393036.0,5473671.0,5556766.0,5641597.0,5727751.0,...,24473178.0,25147109.0,25823485.0,26497889.0,27168210.0,27834821.0,28498687.0,29161922.0,NaN,NaN
261,South Africa,ZAF,"Population, total",SP.POP.TOTL,17099840.0,17524533.0,17965725.0,18423161.0,18896307.0,19384841.0,...,52834005.0,53689236.0,54545991.0,55386367.0,56203654.0,57000451.0,57779622.0,58558270.0,NaN,NaN
262,Zambia,ZMB,"Population, total",SP.POP.TOTL,3070776.0,3164329.0,3260650.0,3360104.0,3463213.0,3570464.0,...,14465121.0,14926504.0,15399753.0,15879361.0,16363507.0,16853688.0,17351822.0,17861030.0,NaN,NaN
263,Zimbabwe,ZWE,"Population, total",SP.POP.TOTL,3776681.0,3905034.0,4039201.0,4178726.0,4322861.0,4471177.0,...,13115131.0,13350356.0,13586681.0,13814629.0,14030390.0,14236745.0,14439018.0,14645468.0,NaN,NaN

In [14]:
df_version1 = df_pob.copy(deep=True)

In [15]:
df_version1

,Country Name,Country Code,Indicator Name,Indicator Code,1960,1961,1962,1963,1964,1965,...,2012,2013,2014,2015,2016,2017,2018,2019,2020,Unnamed: 65
0,Aruba,ABW,"Population, total",SP.POP.TOTL,54211.0,55438.0,56225.0,56695.0,57032.0,57360.0,...,102560.0,103159.0,103774.0,104341.0,104872.0,105366.0,105845.0,106314.0,NaN,NaN
1,Afghanistan,AFG,"Population, total",SP.POP.TOTL,8996973.0,9169410.0,9351441.0,9543205.0,9744781.0,9956320.0,...,31161376.0,32269589.0,33370794.0,34413603.0,35383128.0,36296400.0,37172386.0,38041754.0,NaN,NaN
2,Angola,AGO,"Population, total",SP.POP.TOTL,5454933.0,5531472.0,5608539.0,5679458.0,5735044.0,5770570.0,...,25107931.0,26015780.0,26941779.0,27884381.0,28842484.0,29816748.0,30809762.0,31825295.0,NaN,NaN
3,Albania,ALB,"Population, total",SP.POP.TOTL,1608800.0,1659800.0,1711319.0,1762621.0,1814135.0,1864791.0,...,2900401.0,2895092.0,2889104.0,2880703.0,2876101.0,2873457.0,2866376.0,2854191.0,NaN,NaN
4,Andorra,AND,"Population, total",SP.POP.TOTL,13411.0,14375.0,15370.0,16412.0,17469.0,18549.0,...,82427.0,80774.0,79213.0,78011.0,77297.0,77001.0,77006.0,77142.0,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
259,Kosovo,XKX,"Population, total",SP.POP.TOTL,947000.0,966000.0,994000.0,1022000.0,1050000.0,1078000.0,...,1807106.0,1818117.0,1812771.0,1788196.0,1777557.0,1791003.0,1797085.0,1794248.0,NaN,NaN
260,"Yemen, Rep.",YEM,"Population, total",SP.POP.TOTL,5315355.0,5393036.0,5473671.0,5556766.0,5641597.0,5727751.0,...,24473178.0,25147109.0,25823485.0,26497889.0,27168210.0,27834821.0,28498687.0,29161922.0,NaN,NaN
261,South Africa,ZAF,"Population, total",SP.POP.TOTL,17099840.0,17524533.0,17965725.0,18423161.0,18896307.0,19384841.0,...,52834005.0,53689236.0,54545991.0,55386367.0,56203654.0,57000451.0,57779622.0,58558270.0,NaN,NaN
262,Zambia,ZMB,"Population, total",SP.POP.TOTL,3070776.0,3164329.0,3260650.0,3360104.0,3463213.0,3570464.0,...,14465121.0,14926504.0,15399753.0,15879361.0,16363507.0,16853688.0,17351822.0,17861030.0,NaN,NaN
263,Zimbabwe,ZWE,"Population, total",SP.POP.TOTL,3776681.0,3905034.0,4039201.0,4178726.0,4322861.0,4471177.0,...,13115131.0,13350356.0,13586681.0,13814629.0,14030390.0,14236745.0,14439018.0,14645468.0,NaN,NaN

In [24]:

df_version1.drop(columns=['Country Code',
 'Indicator Name',
 'Indicator Code',
 '1960',
 '1961',
 '1962',
 '1963',
 '1964',
 '1965',
 '1966',
 '1967',
 '1968',
 '1969',
 '1970',
 '1971',
 '1972',
 '1973',
 '1974',
 '1975',
 '1976',
 '1977',
 '1978',
 '1979',
 '1980',
 '1981',
 '1982',
 '1983',
 '1984',
 '1985',
 '1986',
 '1987',
 '1988',
 '1989',
 '1990',
 '1991',
 '1992',
 '1993',
 '1994',
 '1995',
 '1996',
 '1997',
 '1998',
 '1999',
 '2000',
 '2001',
 '2002',
 '2003',
 '2004',
 '2005',
 '2006',
 '2007',
 '2008',
 '2009',
 '2010',
 '2011',
 '2012',
 '2013',
 '2014','2020','Unnamed: 65'], inplace=True)

In [25]:
df_version1

     Country Name        2015        2016        2017        2018        2019
0           Aruba    104341.0    104872.0    105366.0    105845.0    106314.0
1     Afghanistan  34413603.0  35383128.0  36296400.0  37172386.0  38041754.0
2          Angola  27884381.0  28842484.0  29816748.0  30809762.0  31825295.0
3         Albania   2880703.0   2876101.0   2873457.0   2866376.0   2854191.0
4         Andorra     78011.0     77297.0     77001.0     77006.0     77142.0
..            ...         ...         ...         ...         ...         ...
259        Kosovo   1788196.0   1777557.0   1791003.0   1797085.0   1794248.0
260   Yemen, Rep.  26497889.0  27168210.0  27834821.0  28498687.0  29161922.0
261  South Africa  55386367.0  56203654.0  57000451.0  57779622.0  58558270.0
262        Zambia  15879361.0  16363507.0  16853688.0  17351822.0  17861030.0
263      Zimbabwe  13814629.0  14030390.0  14236745.0  14439018.0  14645468.0

[264 rows x 6 columns]

In [43]:
df

      Country Name  year      pob
0            Aruba  2015   104341
1      Afghanistan  2015 34413603
2           Angola  2015 27884381
3          Albania  2015  2880703
4          Andorra  2015    78011
...            ...   ...      ...
1315        Kosovo  2019  1794248
1316   Yemen, Rep.  2019 29161922
1317  South Africa  2019 58558270
1318        Zambia  2019 17861030
1319      Zimbabwe  2019 14645468

[1320 rows x 3 columns]

In [44]:
df_corto = df_version1.copy(deep=True)

In [45]:
df_corto

     Country Name     2015     2016     2017     2018     2019
0           Aruba   104341   104872   105366   105845   106314
1     Afghanistan 34413603 35383128 36296400 37172386 38041754
2          Angola 27884381 28842484 29816748 30809762 31825295
3         Albania  2880703  2876101  2873457  2866376  2854191
4         Andorra    78011    77297    77001    77006    77142
..            ...      ...      ...      ...      ...      ...
259        Kosovo  1788196  1777557  1791003  1797085  1794248
260   Yemen, Rep. 26497889 27168210 27834821 28498687 29161922
261  South Africa 55386367 56203654 57000451 57779622 58558270
262        Zambia 15879361 16363507 16853688 17351822 17861030
263      Zimbabwe 13814629 14030390 14236745 14439018 14645468

[264 rows x 6 columns]

In [46]:
df = pd.melt(df_corto, id_vars=['Country Name'], var_name='year', value_name='pob') # Pivoteo las columnas para convertirlas en filas y ordeno la data primero por ‘year’ y luego por ‘Country’, y ya queda para trabajar con el mismo dataset de la clase

In [31]:
pd.options.display.float_format='{:.0f}'.format # con esto le quitamos todos los decimales a la poblacion

In [47]:
df

      Country Name  year      pob
0            Aruba  2015   104341
1      Afghanistan  2015 34413603
2           Angola  2015 27884381
3          Albania  2015  2880703
4          Andorra  2015    78011
...            ...   ...      ...
1315        Kosovo  2019  1794248
1316   Yemen, Rep.  2019 29161922
1317  South Africa  2019 58558270
1318        Zambia  2019 17861030
1319      Zimbabwe  2019 14645468

[1320 rows x 3 columns]

In [48]:
df.dtypes # Revisando que tipo de datos es la variable

Country Name     object
year             object
pob             float64
dtype: object

In [52]:
df['year']=pd.Categorical(df['year'].apply(str)) # transformando el objeto año en category

In [53]:
df.dtypes

Country Name      object
year            category
pob              float64
dtype: object

In [64]:
df.rename(columns={'Country Name':'Country'}, inplace=True) # Cambiando nombre de una columna existente

In [65]:
df

           Country  year      pob
0            Aruba  2015   104341
1      Afghanistan  2015 34413603
2           Angola  2015 27884381
3          Albania  2015  2880703
4          Andorra  2015    78011
...            ...   ...      ...
1315        Kosovo  2019  1794248
1316   Yemen, Rep.  2019 29161922
1317  South Africa  2019 58558270
1318        Zambia  2019 17861030
1319      Zimbabwe  2019 14645468

[1320 rows x 3 columns]

In [58]:
idx_filtro = df['Country Name'].isin(['Aruba', 'Colombia'])# la funcion isin crea un vector  de variables booleanas (falso7verdadero) que permite filtrar algunos paises en este caso aruba y colombia
idx_filtro

0        True
1       False
2       False
3       False
4       False
        ...
1315    False
1316    False
1317    False
1318    False
1319    False
Name: Country Name, Length: 1320, dtype: bool

In [71]:
df_sample =df[idx_filtro] # Mostrando un nuevo dataframe
df_sample

       Country  year      pob
0        Aruba  2015   104341
43    Colombia  2015 47520667
264      Aruba  2016   104872
307   Colombia  2016 48175048
528      Aruba  2017   105366
571   Colombia  2017 48909844
792      Aruba  2018   105845
835   Colombia  2018 49661056
1056     Aruba  2019   106314
1099  Colombia  2019 50339443

In [72]:
df_sample.set_index(['Country','year']) # Definen los datos del dataframe(elimina el numero lateral)

                   pob
Country  year
Aruba    2015   104341
Colombia 2015 47520667
Aruba    2016   104872
Colombia 2016 48175048
Aruba    2017   105366
Colombia 2017 48909844
Aruba    2018   105845
Colombia 2018 49661056
Aruba    2019   106314
Colombia 2019 50339443

In [73]:
df_sample = df_sample.set_index(['Country','year']).sort_index() # Ordena los paises de una maneja mejor estructurada
df_sample

                   pob
Country  year
Aruba    2015   104341
         2016   104872
         2017   105366
         2018   105845
         2019   106314
Colombia 2015 47520667
         2016 48175048
         2017 48909844
         2018 49661056
         2019 50339443

In [75]:
df_sample.loc['Colombia',:] # Muestra solos los datos del pais, en este caso Colombia

          pob
year
2015 47520667
2016 48175048
2017 48909844
2018 49661056
2019 50339443

In [76]:
df_sample.loc['Colombia',:].loc['2016',:] # Aqui muestra los datos del pais colombia y el año 2016 nada mas

pob   48175048
Name: 2016, dtype: float64

In [77]:
df_sample.xs(['Aruba']) # Seleccionado multiples indices en este caso solo los datos de aruba

        pob
year
2015 104341
2016 104872
2017 105366
2018 105845
2019 106314

In [78]:
df_sample.xs(['Aruba','2018'])# Seleccionado multiples indices en este caso solo los datos de aruba y la poblacion del 2018

pob   105845
Name: (Aruba, 2018), dtype: float64

In [79]:
df_sample.xs('2018', level='year') # estoy esta a bajo nivel en este caso es country y year seleccionando los paises y el año 2018 especificamente

              pob
Country
Aruba      105845
Colombia 49661056

In [86]:
df_countries = df.set_index(['Country','year']).sort_index(ascending=[True, True]) # Ordenando de forma descendiente
df_countries

                      pob
Country     year
Afghanistan 2015 34413603
            2016 35383128
            2017 36296400
            2018 37172386
            2019 38041754
...                   ...
Zimbabwe    2015 13814629
            2016 14030390
            2017 14236745
            2018 14439018
            2019 14645468

[1320 rows x 1 columns]

In [88]:
ids=pd.IndexSlice # Guarda una funcion de una variable numerica tipo texto
df_countries.loc[ids['Aruba': 'Austria', '2015':'2017'],:].sort_index() # con estoy estas colocando rangos entre los paises a y b y entre las fechas a y b

                    pob
Country   year
Aruba     2015   104341
          2016   104872
          2017   105366
Australia 2015 23815995
          2016 24190907
          2017 24601860
Austria   2015  8642699
          2016  8736668
          2017  8797566

In [92]:
df_countries.index.get_level_values(0)# Selecciona los datos del primer nivel osea en este caso es countries, en el segundo nivel es el año

Index(['Afghanistan', 'Afghanistan', 'Afghanistan', 'Afghanistan',
       'Afghanistan', 'Albania', 'Albania', 'Albania', 'Albania', 'Albania',
       ...
       'Zambia', 'Zambia', 'Zambia', 'Zambia', 'Zambia', 'Zimbabwe',
       'Zimbabwe', 'Zimbabwe', 'Zimbabwe', 'Zimbabwe'],
      dtype='object', name='Country', length=1320)

In [97]:
df_countries['pob']['Chile'] ['2018']# Muestra una serie que tiene 2 columnas, y puedo seleccionar un pais

18729160.0

In [98]:
df_countries.sum(level='year') # La suma de la poblacion mundial por año

             pob
year
2015 77802228760
2016 78776007940
2017 79749013306
2018 80705148712
2019 81650010117

In [99]:
df_sample.unstack('year') # Comvertir o cambiar los indices del año en columnas

              pob
year         2015     2016     2017     2018     2019
Country
Aruba      104341   104872   105366   105845   106314
Colombia 47520667 48175048 48909844 49661056 50339443

In [100]:
df_sample.unstack('Country') # Comvertir o cambiar los indices del pais en columnas

           pob
Country  Aruba Colombia
year
2015    104341 47520667
2016    104872 48175048
2017    105366 48909844
2018    105845 49661056
2019    106314 50339443